<template>
  <div class='detail'>
    <!-- 头部名称和等级 -->
    <div class="top">
      <div class="title">{{ hospitalStore.hospitalInfo.hospital?.hosname }}</div>
      <div class="level">
        <svg t="1728028537225" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg"
          p-id="4431" width="16" height="16">
          <path
            d="M190.193225 471.411583c14.446014 0 26.139334-11.718903 26.139334-26.13831 0-14.44499-11.69332-26.164916-26.139334-26.164916-0.271176 0-0.490164 0.149403-0.73678 0.149403l-62.496379 0.146333c-1.425466-0.195451-2.90005-0.295735-4.373611-0.295735-19.677155 0-35.621289 16.141632-35.621289 36.114522L86.622358 888.550075c0 19.949354 15.96767 35.597753 35.670407 35.597753 1.916653 0 3.808746 0.292666 5.649674 0l61.022819 0.022513c0.099261 0 0.148379 0.048095 0.24764 0.048095 0.097214 0 0.146333-0.048095 0.24457-0.048095l0.73678 0 0-0.148379c13.413498-0.540306 24.174586-11.422144 24.174586-24.960485 0-13.55983-10.760065-24.441669-24.174586-24.981974l0-0.393973-50.949392 0 1.450025-402.275993L190.193225 471.409536z"
            fill="#5D5D5D" p-id="4432"></path>
          <path
            d="M926.52241 433.948343c-19.283182-31.445176-47.339168-44.172035-81.289398-45.546336-1.77032-0.246617-3.536546-0.39295-5.380544-0.39295l-205.447139-0.688685c13.462616-39.059598 22.698978-85.58933 22.698978-129.317251 0-28.349675-3.193739-55.962569-9.041934-82.542948l-0.490164 0.049119c-10.638291-46.578852-51.736315-81.31498-100.966553-81.31498-57.264215 0-95.466282 48.15065-95.466282 106.126063 0 3.241834-0.294712 6.387477 0 9.532097-2.996241 108.386546-91.240027 195.548698-196.23636 207.513194l0 54.881958-0.785899 222.227314 0 229.744521 10.709923 0 500.025271 0.222057 8.746198-0.243547c19.35686 0.049119 30.239721-4.817726 47.803749-16.116049 16.682961-10.761088 29.236881-25.50079 37.490869-42.156122 2.260483-3.341095 4.028757-7.075139 5.106298-11.20111l77.018118-344.324116c1.056052-4.053316 1.348718-8.181333 1.056052-12.160971C943.643346 476.446249 938.781618 453.944769 926.52241 433.948343zM893.82573 486.837924l-82.983993 367.783411-0.099261-0.049119c-2.555196 6.141884-6.879688 11.596106-12.872169 15.427364-4.177136 2.727111-8.773827 4.351098-13.414521 4.964058-1.49812-0.195451-3.046383 0-4.620227 0l-477.028511-0.540306-0.171915-407.408897c89.323375-40.266076 154.841577-79.670527 188.596356-173.661202 0.072655 0.024559 0.124843 0.049119 0.195451 0.072655 2.99931-9.137101 6.313799-20.73423 8.697079-33.164331 5.551436-29.185716 5.258771-58.123792 5.258771-58.123792-4.937452-37.98001 25.940812-52.965306 44.364417-52.965306 25.304316 0.860601 50.263777 33.656541 50.263777 52.326762 0 0 5.600555 27.563776 5.649674 57.190537 0.048095 37.366026-4.6673 56.847729-4.6673 56.847729l-0.466628 0c-5.872754 30.879288-16.214287 60.138682-30.464849 86.964654l0.36839 0.342808c-2.358721 4.815679-3.709485 10.220782-3.709485 15.943111 0 19.922748 19.088754 21.742187 38.765909 21.742187l238.761895 0.270153c0 0 14.666024 0.465604 14.690584 0.465604l0 0.100284c12.132318-0.638543 24.221658 5.207605 31.100322 16.409738 5.504364 9.016351 6.437619 19.6045 3.486404 28.988218L893.82573 486.837924z"
            fill="#5D5D5D" p-id="4433"></path>
          <path
            d="M264.827039 924.31872c0.319272 0.024559 0.441045 0.024559 0.295735-0.024559 0.243547-0.048095 0.367367-0.074701-0.295735-0.074701s-0.539282 0.026606-0.271176 0.074701C264.43409 924.343279 264.532327 924.343279 264.827039 924.31872z"
            fill="#5D5D5D" p-id="4434"></path>
        </svg>
        <span>{{ hospitalStore.hospitalInfo.hospital?.param.hostypeString }}</span>
      </div>
    </div>
    <!-- 内容区 -->
    <div class="content">
      <div class="left">
        <!-- 图片刷新就挂,从父组件跳进来的时候传了hoscode,各个子路由之间相互跳的时候没有带 -->
        <img :src="`data:image/jpeg;base64,${hospitalStore.hospitalInfo.hospital?.logoData}`" alt="医院LOGO">
      </div>
      <div class="right">
        <div class="address">
          <svg t="1728477947434" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg"
            p-id="5197" width="16" height="16">
            <path
              d="M874.048 533.333C863.424 716.63 716.629 863.424 533.333 874.048v43.285a21.333 21.333 0 0 1-42.666 0v-43.285C307.37 863.424 160.576 716.629 149.952 533.333h-43.285a21.333 21.333 0 0 1 0-42.666h43.285c10.624-183.296 157.419-330.091 340.715-340.715v-43.285a21.333 21.333 0 0 1 42.666 0v43.285c183.296 10.624 330.091 157.419 340.715 340.715h42.816a21.333 21.333 0 1 1 0 42.666h-42.837z m-42.752 0H703.509a21.333 21.333 0 0 1 0-42.666h127.787c-10.517-159.744-138.24-287.446-297.963-297.963V320a21.333 21.333 0 0 1-42.666 0V192.704c-159.744 10.517-287.446 138.24-297.963 297.963H320a21.333 21.333 0 0 1 0 42.666H192.704c10.517 159.744 138.24 287.446 297.963 297.963V704a21.333 21.333 0 0 1 42.666 0v127.296c159.744-10.517 287.446-138.24 297.963-297.963zM512 554.667a42.667 42.667 0 1 1 0-85.334 42.667 42.667 0 0 1 0 85.334z"
              p-id="5198"></path>
          </svg>
          <span>具体位置:&nbsp;&nbsp;{{ hospitalStore.hospitalInfo.hospital?.param.fullAddress }}</span>
        </div>
        <div class="route">
          规划路线:&nbsp;&nbsp;{{ hospitalStore.hospitalInfo.hospital?.route }}
        </div>
      </div>
    </div>
    <div class="footer">
      <h1>医院介绍</h1>
      <p>
        &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;航天中心医院是集医疗、教学、科研于一体的大型三级综合性医院，是北京大学的临床医学院、北京急救中心西区分中心、航天体检中心、国家临床药理试验机构、北京市职业健康检查机构、北京市工伤定点医疗机构，是全国百姓放心百佳示范医院。<br>

        &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;医院创建于1958年。一直承担着国防、航天系统职工医疗保健任务，建院之初就立志于为祖国的国防和航天事业的发展提供优质的保障服务。1983年面向社会开放，全面为广大社会大众提供服务，实现了由仅服务于国防军工和航天系统的职工医院向服务于社会大众的地方区域性医院的转变。2004年成为北京大学临床医学院，实现了从一般区域性医院到提供高等医学教育的临床医学院的转变。几十年来，医院始终坚持“立足航天，面向社会”的定位，不仅为两弹元勋、国防航天科研人员的医疗健康保障做出了突出贡献，还为北京市医疗卫生事业和国家高等医学教育事业做出了积极贡献。<br>

        &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;医院建筑面积10万平方米，现开放床位1000张，职工2000余人，其中高级专业技术人员200余名，拥有38个专业科室。医院拥有一流的医疗设备和良好的基础设施。<br>

        &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;医院在创建一流的北京大学临床医学院的愿景引领下，确定了“发展综合医院、创建特色医院、打造数字医院、构筑文化医院”的发展方针，以卓越服务为先导，大力实施科教兴院、人才强院战略，经过50多年的顽强拼搏和不懈努力，医院的综合实力显著增强，在行业中的地位显著提升。<br>

        &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;医院学科齐全、技术力量雄厚。形成了以介入技术、微创技术和再生医学为主的专业特色。心血管内科和内分泌专业达到国内先进水平，神经内科、神经外科、肝胆胃肠微创外科、老年医学、胸外科、血液科、呼吸内科、妇产科、超声科、口腔科等学科达到北京市先进水平。医院其他学科协调发展，各具特色，均具有相当实力。<br>

        &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;医院始终将医疗质量与安全放在首位。瞄准医疗行业一流的医疗质量管理水平，培育医疗质量文化，以患者满意为导向，构建高效的医疗质量管理体系，促进医疗质量内涵和管理水平不断提升。2011年因此荣获第十七届全国企业管理现代化创新成果二等奖。<br>

        &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;医院不断深化服务内涵，提升服务品质。秉承“服务永恒·追求卓越”的理念，“张佩珊”服务品牌以人性化服务特色脱颖而出，成为医院服务的一面旗帜，有力地带动了全院医疗服务水平的全面提高，赢得了患者和社会的广泛赞誉。张佩珊护理组先后获中央国家机关“青年文明号”、全国总工会“女职工建功立业标兵岗”和全国妇联“巾帼文明岗”等称号。<br>

        &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;医院科研教育成绩斐然。在科研方面承担着国家“十五”、“十一五”攻关项目、国家自然科学基金、国防基础科研项目、北京市科委项目等省部级以上课题，获得省部级以上科研成果奖10余项。作为北京大学临床医学院，医院是培养高层次医学人才的临床教学基地，承担着北医统招研究生、五年制本科生的全程教育任务。医院是北京市继续教育基地、北京市全科医师培训基地。医院已成为集大中专生、本科生、研究生及各级继续医学教育、具有较高教学水平的医学人才教育教学基地。<br>

        &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;医院文化建设成效显著。“服务永恒·追求卓越”的理念深入人心，人人践行，全员职工以患者为中心，以良好的精神风貌提供优质服务。同时医院坚持以人为本，努力提高职工满意度和幸福感，已建成省部级模范职工之家，正在全力创建全国模范职工之家。医院形成了和谐的医患关系和内部氛围。<br>

        &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;医院赢得了广泛肯定和赞誉。2012年荣获全国百姓放心百佳示范医院、全国军民共建精神文明先进单位和首都文明单位标兵称号，此前连续8年获得首都文明单位称号，并获得中央国家机关文明单位标兵等多项荣誉。2006年在北京地区患者满意度调查中，名列第一，是北京市公众认可的十家医院之一。<br>

        &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;50多年来，航天中心医院以执着的追求铸就了辉煌的历史，今天正朝着创建一流的北京大学临床医学院的愿景而努力奋斗。<br>
      </p>
    </div>
  </div>
</template>

<script lang='ts' setup name='Detail'>
import useDetailStore from '@/store/modules/hospitalDetail';
//数据
let hospitalStore = useDetailStore()


//方法

</script>

<style scoped lang="scss">
.detail {
  margin: 30px 30px 0px 30px;

  .top {
    display: flex;

    .title {
      font-size: 30px;
    }

    .level {
      color: #7f7f7f;
      margin-left: 10px;
      text-align: center;
      line-height: 40px;

      span {
        margin-left: 5px;
      }
    }
  }

  .content {
    display: flex;
    margin-top: 20px;

    .left {
      width: 80px;

      img {
        width: 80px;
        height: 80px;
        border-radius: 50%;
      }
    }

    .right {
      flex: 1;
      margin: 10px 20px 30px 20px;

      .route {
        margin-left: 15px;
      }

      .address,
      .route {
        display: flex;
        align-items: center;
        font-size: 14px;
        color: #7f7f7f;
        margin-top: 10px;


      }
    }
  }

  .footer {
    p {
      color: #7f7f7f;
      margin-top: 10px;
      line-height: 30px;
    }
  }
}
</style>